precursor_kOmegaSSTFine/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
2880
(
(0.0248406 -2.12368e-09 -1.59011e-10)
(0.0248404 -5.07061e-09 5.94371e-10)
(0.0248405 7.22995e-09 -4.45567e-10)
(0.0623765 1.50556e-09 -1.29634e-09)
(0.0623743 -7.96767e-09 5.12775e-09)
(0.0623743 6.23716e-09 -3.81821e-09)
(0.0722802 2.41357e-08 -1.78209e-09)
(0.0722782 -2.39608e-08 5.54745e-09)
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    noSlipWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
