precursor_kOmegaSSTFine/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2880
(
1.45207e-05
1.45201e-05
1.45206e-05
6.30385e-05
6.30295e-05
6.30312e-05
8.65673e-05
8.65573e-05
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
192
(
7.65394e-06
8.18964e-05
8.18964e-05
0.000140118
0.000189936
0.000236844
0.000236844
0.000282674
...
)
;
    }
    noSlipWalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
90
(
7.65394e-06
2.94305e-05
4.49622e-05
6.25737e-05
8.30664e-05
0.000107237
0.000135929
0.000170305
...
)
;
    }
}


// ************************************************************************* //
