precursor_kOmegaSSTFine/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    freeSurface
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            calculated;
        value           nonuniform List<vector> 
192
(
(-3.69151e-06 3.9574e-13 3.77958e-12)
(-2.05422e-05 1.02983e-12 3.19349e-13)
(-2.05422e-05 1.02983e-12 3.19349e-13)
(-3.73926e-05 5.34552e-13 -2.97009e-13)
(-5.24387e-05 -1.59547e-12 1.92925e-12)
(-6.64037e-05 -1.35935e-12 4.70344e-12)
(-6.64037e-05 -1.35935e-12 4.70344e-12)
(-8.001e-05 -3.11462e-13 7.3199e-12)
...
)
;
    }
    noSlipWalls
    {
        type            calculated;
        value           nonuniform List<vector> 
90
(
(-6.95532e-05 6.8587e-12 7.20638e-13)
(-0.000183445 -3.91187e-12 6.21127e-12)
(-0.00021369 -7.51825e-11 9.18e-12)
(-0.000237694 -1.53178e-10 6.24898e-12)
(-0.000258136 -1.42073e-10 1.75642e-12)
(-0.000276046 -1.10064e-10 -3.64346e-12)
(-0.000291947 -6.1032e-11 -6.13757e-12)
(-0.000306257 -3.30464e-11 -7.58957e-12)
...
)
;
    }
}


// ************************************************************************* //
