precursor_kOmegaSSTFine/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    freeSurface
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
8.79044
28.7542
28.7542
37.611
43.7897
48.8989
48.8989
53.4209
...
)
;
    }
    noSlipWalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
90
(
0.46655
0.91486
1.13078
1.33399
1.53698
1.74634
1.96613
2.20074
...
)
;
    }
}


// ************************************************************************* //
