precursor_kOmegaSSTFine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    freeSurface
    {
        type            patch;
        nFaces          90;
        startFace       7494;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          960;
        startFace       7584;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          960;
        startFace       8544;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    sidewalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       9504;
    }
    noSlipWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       9696;
    }
)

// ************************************************************************* //
